wegam/STM32F1xWOW/FWLIB/Components/SCR/R61509V.c
/**************************************************************************************************
* Copyright (C), 1997-$(Year),  HAICHUANG IOT Tech. Co., Ltd.
* 文件<$(filename)>
* 模块描述 :	定义、功能、说明
* 历史修改记录
*     <主要修改者>  <时间>   <版本 >   <说明>
*     xlyan        $(Date)   1.0.0    创建文件
**************************************************************************************************/
#include "R61509V.h"

#include "STM32_GPIO.H"
#include "STM32_PWM.H"
#include "font.h"

//#ifdef LCD_61509_EN

t_LcdCfg g_LcdCfg;

u16 Sreen_Rotate=SCREEN_ROTATE_270D;			//屏方向

R61509V_Pindef *R61509V_sPinfo=0;

u16 R61509V_BACK_COLOR	=	R61509V_BLACK;		//背景色
u16 R61509V_POINT_COLOR	=	R61509V_BLUE;   	//画笔色

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void R61509V_Delay(u32 xms)
{
	while(xms--);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void R61509V_PinConf(R61509V_Pindef *Pinfo)
{
	GPIO_Configuration_OPP50	(Pinfo->R61509V_sBL_PORT,				Pinfo->R61509V_sBL_Pin);		//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Pinfo->R61509V_sRD_PORT,				Pinfo->R61509V_sRD_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Pinfo->R61509V_sREST_PORT,			Pinfo->R61509V_sREST_Pin);				//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Pinfo->R61509V_sRS_PORT,				Pinfo->R61509V_sRS_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Pinfo->R61509V_sWR_PORT,				Pinfo->R61509V_sWR_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Pinfo->R61509V_sCS_PORT,				Pinfo->R61509V_sCS_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Pinfo->R61509V_sTE_PORT,				Pinfo->R61509V_sTE_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Pinfo->R61509V_sDATABUS_PORT,	Pinfo->R61509V_sDATABUS_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	R61509V_sPinfo=Pinfo;
	
	R61509V_BL_ON;
	
	R61509V_Initialize();		////按照主控芯片R61509V的power supply on sequence 进行配置
	
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
	
//	R61509V_PowerOn();
}
/**************************************************************************************************
* [Function] LCD_GetCfg:  函数功能、注意事项等的描述
* [No param][return]*: description
**************************************************************************************************/
t_LcdCfg * LCD_GetCfg( void )
{
	return(&g_LcdCfg);
}


/**************************************************************************************************
* [Function] LCD_WriteCom:  函数功能、注意事项等的描述
* [param01]u16 Com: description
**************************************************************************************************/
void R61509V_Write_Bus( u16 Com )
{
	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_LOW;
	R61509V_DATABUS_PORT->ODR = Com;
	R61509V_WR_LOW;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}

#if 1

/**************************************************************************************************
* [Function] LCD_WriteData:  函数功能、注意事项等的描述
* [param01]u16 Dat: description
**************************************************************************************************/
void R61509V_WriteData( u16 Dat )
{
	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_HIGH;
	R61509V_DATABUS_PORT->ODR = Dat;
	R61509V_WR_LOW;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}

#endif


/**************************************************************************************************
* [Function] LCD_WriteCMD: 向lcd写入指令数据
* [param01]u16 addr: 指令
* [param02]u16 Data: 指令数据
**************************************************************************************************/
void R61509V_WriteCMD( u16 addr, u16 Data )
{
/*
 * LCD_WriteCom( addr );
 * LCD_WriteData( Data );
 */

	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_LOW;
	R61509V_DATABUS_PORT->ODR = addr;
	R61509V_WR_LOW;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
	/*Delay_us( 200 ); */

	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_HIGH;
	R61509V_DATABUS_PORT->ODR = Data;
	R61509V_WR_LOW;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}


/**************************************************************************************************
* [Function] LCD_ReadData:  从LCD读取数据
* [No param][return]u16: 返回数据
**************************************************************************************************/
u16 R61509V_ReadData( void )
{
	u16 Dat;

	R61509V_CS_LOW;
	R61509V_WR_HIGH;
	R61509V_RS_HIGH;
	Dat = R61509V_DATABUS_PORT->IDR;
	R61509V_RD_LOW;
	R61509V_RD_HIGH;
	R61509V_CS_HIGH;

	return(Dat);
}


/**************************************************************************************************
* [Function] LCD_SetDrawWindow:  LCD 屏显示扫描方式
* [param01]t_Sreen_Rotate ScrnRotat: 相对于逐行从左到右 翻转角度值
* [param02]t_PixCfg PixCfg: 显示像素配置
* [param03]t_Point top_p: 顶点坐标
* [param04]u16 bottom_p: 底部坐标
**************************************************************************************************/
void R61509V_SetDrawWindow( t_Point top_p, t_Point bottom_p )
{
	u16 HSA, HEA, VSA, VEA;

	switch ( LCD_GetCfg()->ScrnRotat )
	{
	case SCREEN_ROTATE_0D:
	{
		HSA	= top_p.x;
		HEA	= bottom_p.x;
		VSA	= top_p.y;
		VEA	= bottom_p.y;
		break;
	}
	case SCREEN_ROTATE_90D:
	{
		HSA	= LCD_GetCfg()->PixCfg.YPixNum - bottom_p.y - 1;
		HEA	= LCD_GetCfg()->PixCfg.YPixNum - top_p.y - 1;
		VSA	= top_p.x;
		VEA	= bottom_p.x;
		break;
	}
	case SCREEN_ROTATE_180D:
	{
		HSA	= LCD_GetCfg()->PixCfg.XPixNum - bottom_p.x - 1;
		HEA	= LCD_GetCfg()->PixCfg.XPixNum - top_p.x - 1;
		VSA	= LCD_GetCfg()->PixCfg.YPixNum - bottom_p.y - 1;
		VEA	= LCD_GetCfg()->PixCfg.YPixNum - top_p.y - 1;
		break;
	}
	case SCREEN_ROTATE_270D:
	{
		HSA	= top_p.y;
		HEA	= bottom_p.y;
		VSA	= LCD_GetCfg()->PixCfg.XPixNum - bottom_p.x - 1;
		VEA	= LCD_GetCfg()->PixCfg.XPixNum - top_p.x - 1;
		break;
	}
	default: break;
	}
	R61509V_WriteCMD( R61509V_R210_HSA, HSA );
	R61509V_WriteCMD( R61509V_R211_HEA, HEA );
	R61509V_WriteCMD( R61509V_R212_VSA, VSA );
	R61509V_WriteCMD( R61509V_R213_VEA, VEA );
}


