wegam/STM32F1xWOW/FWLIB/Components/SCR/R61509V.c
/**************************************************************************************************
* [Function] LCD_DrawHLine:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 Len: description
* [param04]u16 color: description
**************************************************************************************************/
void R61509V_DrawHLine( u16 x, u16 y, u16 Len, u16 color )
{
	u16 i;

	for ( i = 0; i < Len; i++ )
		R61509V_DrawPixelEx( i + x, y, color );
}


/**************************************************************************************************
* [Function] LCD_DrawVLine:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 Len: description
* [param04]u16 color: description
**************************************************************************************************/
void R61509V_DrawVLine( u16 x, u16 y, u16 Len, u16 color )
{
	u16 i;
	for ( i = 0; i < Len; i++ )
		R61509V_DrawPixelEx( x, i + y, color );
}


/**************************************************************************************************
* [Function] LCD_SetDispalyRange:  函数功能、注意事项等的描述
* [param01]t_LcdCfg * pLcdCfg: description
* [param02]u16 StartLine: description
* [param03]u16 LineNum: description
**************************************************************************************************/
void R61509V_SetDispalyRange( u16 StartLine, u16 LineNum )
{
	u16	DC1 = 0;
	u16	Width, Height;

	if ( LineNum < LCD_PHY_HEIGHT )
	{
		DC1 = (u16) LCD_DC1_IMAGE_ENABLE_BIT;
		R61509V_WriteCMD( R61509V_R500_PTDP, StartLine );
		R61509V_WriteCMD( R61509V_R501_PTSA, 0 );
		R61509V_WriteCMD( R61509V_R502_PTEA, LineNum - 1 );
		Height	= LineNum;
		Width	= LCD_PHY_WIDTH;
	}else {
		DC1	= (u16) LCD_DC1_PARTIAL_ENABLE_BIT;
		Height	= LCD_PHY_HEIGHT;
		Width	= LCD_PHY_WIDTH;
	}

	if ( (LCD_GetCfg()->ScrnRotat == SCREEN_ROTATE_0D) || (LCD_GetCfg()->ScrnRotat == SCREEN_ROTATE_180D) )
	{
		LCD_GetCfg()->PixCfg.XPixNum	= Width;
		LCD_GetCfg()->PixCfg.YPixNum	= Height;
	}else {
		LCD_GetCfg()->PixCfg.XPixNum	= Height;
		LCD_GetCfg()->PixCfg.YPixNum	= Width;
	}

	R61509V_WriteCMD( R61509V_R007_DC1, DC1 );
}


/**************************************************************************************************
* [Function] LCD_DrawBox:  同过顶点和底部坐标画一个矩形
* [param01]t_WinCfg cfg: LCD 相关配置参数
* [param02]t_Point * pTop: description
* [param03]t_Point * pBottom: description
**************************************************************************************************/
void R61509V_DrawBox( t_Point Top, t_Point Bottom )
{
	u32 i, Cnt;

	Cnt = (Bottom.x - Top.x + 1) * (Bottom.y - Top.y + 1);

	R61509V_SetDrawWindow( Top, Bottom );
	R61509V_SetGramAddress( Top );

	R61509V_CS_LOW;
	R61509V_RS_HIGH;
	R61509V_RD_HIGH;


	for ( i = 0; i < Cnt; i++ )
	{
	
		R61509V_DATABUS_PORT->ODR = LCD_GetCfg()->ForeColor;
		R61509V_WR_LOW;
		R61509V_WR_HIGH;
	}
	R61509V_CS_HIGH;
}


///**************************************************************************************************
//* [Function] LCD_DrawLine:  AB 两个坐标画一条直线
//* [param01]t_Point * pPointA: A点坐标
//* [param02]t_Point * pPointB: b点坐标
//* [param03]u16 color: 颜色
//**************************************************************************************************/
//void R61509V_DrawLine( t_Point *pPointA, t_Point *pPointB, u16 color )
//{
//	s16	x, y, dx, dy, s1, s2;
//	s16	i, p, temp, interchange;


//	x	= pPointA->x;
//	y	= pPointA->y;

//	dx = pPointB->x - pPointA->x;
//	if ( dx < 0 )
//		dx = -dx;
//	dy = pPointB->y - pPointA->y;
//	if ( dy < 0 )
//		dy = -dy;

//	if ( pPointB->x > pPointA->x )
//		s1 = 1;
//	else
//		s1 = -1;

//	if ( pPointB->y > pPointA->y )
//		s2 = 1;
//	else
//		s2 = -1;

//	if ( dy > dx )
//	{
//		temp		= dx;
//		dx		= dy;
//		dy		= temp;
//		interchange	= 1;
//	}else {
//		interchange = 0;
//	}

//	p = 2 * dy - dx;

//	for ( i = 1; i <= dx; i++ )
//	{
//		R61509V_DrawPixelEx( x, y, color );
//		if ( p >= 0 )
//		{
//			if ( interchange == 0 )
//				y += s2;
//			else
//				x += s1;
//			p -= 2 * dx;
//		}
//		if ( interchange == 0 )
//			x += s1;
//		else
//			y += s2;
//		p += 2 * dy;
//	}
//}


///**************************************************************************************************
//* [Function] LCD_DrawRectangle:  画一下矩形框
//* [param01]t_Point top_p: 顶点坐标值
//* [param02]t_Point botton_p : 地板坐标值
//**************************************************************************************************/
//void R61509V_DrawRectangle( t_Point *pTop_p, t_Point *pBotton_p, u16 color )
//{
//	R61509V_DrawHLine( pTop_p->x, pTop_p->y, pBotton_p->x - pTop_p->x + 1, color );
//	R61509V_DrawVLine( pTop_p->x, pTop_p->y, pBotton_p->y - pTop_p->y + 1, color );
//	R61509V_DrawHLine( pTop_p->x, pBotton_p->y, pBotton_p->x - pTop_p->x + 1, color );
//	R61509V_DrawVLine( pBotton_p->x, pTop_p->y, pBotton_p->y - pTop_p->y + 1, color );
//}


///**************************************************************************************************
//* [Function] LCD_DrawCircle:  函数功能、注意事项等的描述
//* [param01]t_Point point: description
//* [param02]u16 R: description
//* [param03]uint8_t Filled: description
//* [param04]u16 color: description
//**************************************************************************************************/
//void R61509V_DrawCircle( t_Point point, u16 R, u8 Filled, u16 color )
//{
//	s16 x, y, d;

//	x	= 0;
//	y	= R;
//	d	= 1 - R;

//	while ( x < y )
//	{
//		if ( Filled )
//		{
//			R61509V_DrawHLine( -y + point.x, x + point.y, 2 * y, color );
//			R61509V_DrawHLine( -x + point.x, y + point.y, 2 * x, color );
//			R61509V_DrawHLine( -x + point.x, -y + point.y, 2 * x, color );
//			R61509V_DrawHLine( -y + point.x, -x + point.y, 2 * y, color );
//		}
//		else
//		{
//			R61509V_DrawPixelEx( y + point.x, x + point.y, color );
//			R61509V_DrawPixelEx( x + point.x, y + point.y, color );
//			R61509V_DrawPixelEx( x + point.x, -y + point.y, color );
//			R61509V_DrawPixelEx( y + point.x, -x + point.y, color );
//			R61509V_DrawPixelEx( -y + point.x, x + point.y, color );
//			R61509V_DrawPixelEx( -x + point.x, y + point.y, color );
//			R61509V_DrawPixelEx( -x + point.x, -y + point.y, color );
//			R61509V_DrawPixelEx( -y + point.x, -x + point.y, color );
//		}

//		if ( d < 0 )
//			d += 2 * x + 3;
//		else{
//			d += 2 * (x - y) + 5;
//			y--;
//		}
//		x++;
//	}
//}


