wegam/STM32F1xWOW/FWLIB/Components/SCR/R61509V.c
	R61509V_WriteCommand(R61509V_R000_IR		,	0x0000);		R61509V_Delay(dtime); //四次写0x00
	R61509V_WriteCommand(R61509V_R000_IR		,	0x0000);		R61509V_Delay(dtime); //四次写0x00
	R61509V_WriteCommand(R61509V_R000_IR		,	0x0000);		R61509V_Delay(dtime); //四次写0x00
	R61509V_WriteCommand(R61509V_R000_IR		,	0x0000);		R61509V_Delay(dtime); //四次写0x00
	
	R61509V_WriteCommand(R61509V_R001_DOC		,	0x0100);		R61509V_Delay(dtime); //--------显示方向控制When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
	R61509V_WriteCommand(R61509V_R002_DWC		,	0x0100);		R61509V_Delay(dtime); //--------	
	R61509V_WriteCommand(R61509V_R003_EM		,	0X5030);		R61509V_Delay(dtime); //--------RGB设为5-6-5模式------------0X5030
	R61509V_WriteCommand(R61509V_R007_DC1		,	0x0100);		R61509V_Delay(dtime); //--------测试显示控制base image的关与开
	R61509V_WriteCommand(R61509V_R008_DC2		,	0X0808);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R009_DC3		,	0x0001);		R61509V_Delay(dtime); //--------
	
	
	
	R61509V_WriteCommand(R61509V_R400_BINL	,	0X6400);		R61509V_Delay(dtime); //base image 设置 400线
	
	
	R61509V_WriteCommand(R61509V_R300_YC1		,	0x0C00);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R301_YC2		,	0x5A0B);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R302_YC3		,	0x0906);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R303_YC4		,	0x1017);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R304_YC5		,	0x2300);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R305_YC6		,	0x1700);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R306_YC7		,	0x6309);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R307_YC8		,	0x0C09);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R308_YC9		,	0x100C);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R309_YC10	,	0x2232);		R61509V_Delay(dtime); //--------
	
	R61509V_WriteCommand(R61509V_R010_PIC1	,	0x001F);		R61509V_Delay(dtime); //--------面板频率--0x19
	R61509V_WriteCommand(R61509V_R100_PC1		,	0x0330);		R61509V_Delay(dtime); //--------设置电源控制，平衡显示与电消耗
	R61509V_WriteCommand(R61509V_R101_PC2		,	0x0247);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R102_PC3		,	0xC1B0);		R61509V_Delay(dtime); //--------PSON,PON 都设为1，电源供应打开
	
	
	R61509V_WriteCommand(R61509V_R00B_ECC		,	0x0001);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R00C_EDIC1	,	0x0000);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R00F_EDIC2	,	0x0000);		R61509V_Delay(dtime); //--------
	
	R61509V_WriteCommand(R61509V_R011_PIC2	,	0x0101);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R012_PIC3	,	0x0000);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R013_PIC4	,	0x0001);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R014_PIC5	,	0x0055);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R020_PIC6	,	0x0019);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R021_PIC7	,	0x0101);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R022_PIC8	,	0x0000);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R023_PIC9	,	0x0001);		R61509V_Delay(dtime); //--------
	
	R61509V_WriteCommand(R61509V_R090_FMC		,	0x8000);		R61509V_Delay(dtime); //--------窗特征控制，FMARK interface
	R61509V_WriteCommand(R61509V_R103_PC4		,	0x0D00);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R401_BIDC	,	0x0004);		R61509V_Delay(dtime); //--------设置base image 滚动模式，开启滚动(颜色反相设置）

	
	R61509V_WriteCommand(R61509V_R280_NVM		,	0xB000);		R61509V_Delay(dtime);	//--------VCM	
	R61509V_WriteCommand(R61509V_R502_PTEA	,	0x005f);		R61509V_Delay(dtime);
	R61509V_WriteCommand(R61509V_R404_BIVSC	,	0x0000);		R61509V_Delay(dtime);	//--------从0线开始滚
	R61509V_WriteCommand(R61509V_R200_HA		,	0x0000);		R61509V_Delay(dtime);	//--------RAM address 设置
	R61509V_WriteCommand(R61509V_R201_VA		,	0x0000);		R61509V_Delay(dtime);	//--------
	
	
	//-----------------测试开始	
//	R61509V_WriteCommand(R61509V_R210_HSA		,	0x0015);		R61509V_Delay(dtime);	//--------RAM address 设置
//	R61509V_WriteCommand(R61509V_R211_HEA		,	0x00E0);		R61509V_Delay(dtime);	//--------
//	
//	R61509V_WriteCommand(R61509V_R212_VSA		,	0x0015);		R61509V_Delay(dtime);	//--------RAM address 设置
//	R61509V_WriteCommand(R61509V_R213_VEA		,	0x00FF);		R61509V_Delay(dtime);	//--------
//	
//	R61509V_WriteCommand(R61509V_R200_HA		,	0x0015);		R61509V_Delay(dtime);	//--------RAM address 设置
//	R61509V_WriteCommand(R61509V_R201_VA		,	0x0015);		R61509V_Delay(dtime);	//--------
	//-----------------测试结束

	R61509V_WriteIndex16(0X202);					R61509V_Delay(dtime);		//准备写入

//	Sreen_Rotate=SCREEN_ROTATE_0D;				//显示方式
	
	
	
	
	
	
	
	
	
	
	
	


















//----正常201707181400
//	R61509V_WR_HIGH;
//	R61509V_RD_HIGH;
//	R61509V_CS_LOW;
//	R61509V_RST_HIGH;
//	R61509V_Delay(dtime);
//	R61509V_RST_LOW;
//	R61509V_Delay(dtime);
//	R61509V_RST_HIGH;
//	
//	R61509V_WriteCommand(R61509V_R000_IR		,		0x00);		R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR		,		0x00);		R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR		,		0x00);		R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR		,		0x00);		R61509V_Delay(dtime); //四次写0x00
//	
//	R61509V_WriteCommand(R61509V_R400_BINL	,	0X6400);		R61509V_Delay(dtime); //base image 设置 400线
//	R61509V_WriteCommand(R61509V_R008_DC2		,	0X0808);		R61509V_Delay(dtime); //--------
//	
//	R61509V_WriteCommand(R61509V_R300_YC1		,	0x0C00);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R301_YC2		,	0x5A0B);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R302_YC3		,	0x0906);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R303_YC4		,	0x1017);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R304_YC5		,	0x2300);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R305_YC6		,	0x1700);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R306_YC7		,	0x6309);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R307_YC8		,	0x0C09);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R308_YC9		,	0x100C);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R309_YC10	,	0x2232);		R61509V_Delay(dtime); //--------
//	
//	R61509V_WriteCommand(R61509V_R010_PIC1	,	0x0019);		R61509V_Delay(dtime); //--------面板频率
//	R61509V_WriteCommand(R61509V_R100_PC1		,	0x0330);		R61509V_Delay(dtime); //--------设置电源控制，平衡显示与电消耗
//	R61509V_WriteCommand(R61509V_R101_PC2		,	0x0247);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R102_PC3		,	0xC1B0);		R61509V_Delay(dtime); //--------PSON,PON 都设为1，电源供应打开
//	
//	R61509V_WriteCommand(R61509V_R009_DC3		,	0x0001);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R00B_ECC		,	0x0001);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R00C_EDIC1	,	0x0000);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R00F_EDIC2	,	0x0000);		R61509V_Delay(dtime); //--------
//	
//	R61509V_WriteCommand(R61509V_R011_PIC2	,	0x0101);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R012_PIC3	,	0x0000);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R013_PIC4	,	0x0001);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R014_PIC5	,	0x0055);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R020_PIC6	,	0x0019);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R021_PIC7	,	0x0101);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R022_PIC8	,	0x0000);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R023_PIC9	,	0x0001);		R61509V_Delay(dtime); //--------
//	
//	R61509V_WriteCommand(R61509V_R090_FMC		,	0x8000);		R61509V_Delay(dtime); //--------窗特征控制，FMARK interface
//	R61509V_WriteCommand(R61509V_R103_PC4		,	0x0D00);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R401_BIDC	,	0x0004);		R61509V_Delay(dtime); //--------设置base image 滚动模式，开启滚动(颜色反相设置）
//	R61509V_WriteCommand(R61509V_R002_DWC		,	0x0100);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(R61509V_R001_DOC		,	0x0100);		R61509V_Delay(dtime); //--------显示方向控制When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	R61509V_WriteCommand(R61509V_R003_EM		,	0X5030);		R61509V_Delay(dtime); //--------RGB设为5-6-5模式------------0X5030
//	R61509V_WriteCommand(R61509V_R007_DC1		,	0x0100);		R61509V_Delay(dtime); //--------测试显示控制base image的关与开
//	
//	R61509V_WriteCommand(R61509V_R280_NVM		,	0xB000);		R61509V_Delay(dtime);	//--------VCM	
//	R61509V_WriteCommand(R61509V_R502_PTEA	,	0x005f);		R61509V_Delay(dtime);
//	R61509V_WriteCommand(R61509V_R404_BIVSC	,	0x0000);		R61509V_Delay(dtime);	//--------从0线开始滚
//	R61509V_WriteCommand(R61509V_R200_HA		,	0x0000);		R61509V_Delay(dtime);	//--------RAM address 设置
//	R61509V_WriteCommand(R61509V_R201_VA		,	0x0000);		R61509V_Delay(dtime);	//--------


