wegam/STM32F1xWOW/FWLIB/Components/SCR/R61509V.c
//	R61509V_WriteIndex16(0X202);					R61509V_Delay(dtime);		//准备写入

//	Sreen_Rotate=SCREEN_ROTATE_270D;				//显示方式
	



//	R61509V_WR_HIGH;
//	R61509V_RD_HIGH;
//	R61509V_CS_LOW;
//	R61509V_RST_HIGH;
//	R61509V_Delay(dtime);
//	R61509V_RST_LOW;
//	R61509V_Delay(dtime);
//	R61509V_RST_HIGH;
//	
//	R61509V_WriteCommand(R61509V_R000_IR,0x00);			R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR,0x00);			R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR,0x00);			R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR,0x00);			R61509V_Delay(dtime); //四次写0x00
//	
//	R61509V_WriteCommand(R61509V_R400_BINL,0X6400);		R61509V_Delay(dtime); //base image 设置 400线
//	R61509V_WriteCommand(0X008,0X0808);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(0X300,0X0C00);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(0X010,0X0019);		R61509V_Delay(dtime); //面板频率
//	R61509V_WriteCommand(0X100,0X330);		R61509V_Delay(dtime);	//设置电源控制，平衡显示与电消耗
//	R61509V_WriteCommand(0x102,0xd1b0);		R61509V_Delay(dtime);	//PSON,PON 都设为1，电源供应打开
//	R61509V_WriteCommand(0x280,0xbf00);		R61509V_Delay(dtime);	//VCM


//	
//	R61509V_WriteCommand(0X0003,0X5030);	R61509V_Delay(500);	//RGB设为5-6-5模式------------0X5030

//	R61509V_WriteCommand(0X0001,0X0100);	R61509V_Delay(dtime);	//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	R61509V_WriteCommand(0X007,0X0100);		R61509V_Delay(dtime);	//测试显示控制base image的关与开

//	R61509V_WriteCommand(0X200,0X00);			R61509V_Delay(dtime); //设置RAM ADDRESS

//	R61509V_WriteCommand(0X201,0X00);			R61509V_Delay(dtime); 


//	R61509V_WriteCommand(0X401,0X01);			R61509V_Delay(dtime); //设置base image 滚动模式，开启滚动

//	R61509V_WriteCommand(0x0C,0x0000);		R61509V_Delay(dtime); //外部显示接口控制，默认值
//	R61509V_WriteCommand(0x090,0x8000);		R61509V_Delay(dtime); //窗特征控制，FMARK interface
//	R61509V_WriteCommand(0X404,0X00);			R61509V_Delay(dtime);  //从0线开始滚
//	

//	
//	
//	R61509V_WriteCommand(0X502,0X5f);			R61509V_Delay(dtime);
//	
//	
//	
//	R61509V_WriteCommand(0x200,0x0000);		R61509V_Delay(dtime);		//RAM address 设置

//	R61509V_WriteCommand(0x201,0x0000);		R61509V_Delay(dtime);

//	R61509V_WriteIndex16(0X202);					R61509V_Delay(dtime);		//准备写入


//	Sreen_Rotate=SCREEN_ROTATE_270D;				//显示方式
	
	
	#else
	
	
	R61509V_WR_HIGH;
	R61509V_RD_HIGH;
	R61509V_CS_LOW;
	R61509V_RST_HIGH;
	R61509V_Delay(200);
	R61509V_RST_LOW;
	R61509V_Delay(2000);
	R61509V_RST_HIGH;
	
	
	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500); //四次写0x00
	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
	R61509V_WriteCommand(0X400,0X6200); //base image 设置 400线
	R61509V_WriteCommand(0X010,0X0019); //面板频率
	R61509V_WriteCommand(0X100,0X330);	//设置电源控制，平衡显示与电消耗
	R61509V_WriteCommand(0x102,0xd1b0);R61509V_Delay(500);//PSON,PON 都设为1，电源供应打开
	R61509V_WriteCommand(0x280,0xbf00);R61509V_Delay(500);//VCM
	R61509V_Delay(500);
	R61509V_WriteCommand(0X0003,0X5030);R61509V_Delay(500);//RGB设为5-6-5模式
	R61509V_Delay(200);
	R61509V_WriteCommand(0X0001,0X0100);//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
	R61509V_WriteCommand(0X007,0X0100);//测试显示控制base image的关与开
	R61509V_Delay(200);
	R61509V_Delay(200);
	R61509V_WriteCommand(0X200,0X00); //设置RAM ADDRESS
	R61509V_Delay(200);
	R61509V_WriteCommand(0X201,0X00); 
	R61509V_Delay(200);


	R61509V_Delay(200);
	R61509V_WriteCommand(0X401,0X01); 										//设置base image 滚动模式，开启滚动
	R61509V_Delay(200);
	R61509V_WriteCommand(0x0C,0x0000);R61509V_Delay(1000); //外部显示接口控制，默认值
	R61509V_WriteCommand(0x090,0x8000);R61509V_Delay(1000); //窗特征控制，FMARK interface
	R61509V_WriteCommand(0X404,0X00);R61509V_Delay(1000);  //从0线开始滚
	R61509V_WriteCommand(0X502,0X5f);R61509V_Delay(1000);
	R61509V_WriteCommand(0x200,0x0000);		//RAM address 设置
	R61509V_Delay(1000);
	R61509V_WriteCommand(0x201,0x0000);
	R61509V_Delay(1000);
	R61509V_Delay(1000);
	R61509V_WriteIndex16(0X202);		//准备写入
	R61509V_Delay(1000);
	#endif
}
/*******************************************************************************
*函数名			:	R61509V_Initialize
*功能描述		:	IC初始化：按照主控芯片R61509V的power supply on sequence 进行配置
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_InitializeB(void)			//按照主控芯片R61509V的power supply on sequence 进行配置
{
//	#if 1
//	R61509V_WR_HIGH;
//	R61509V_RD_HIGH;
//	R61509V_CS_LOW;
//	R61509V_RST_HIGH;
//	R61509V_Delay(200);
//	R61509V_RST_LOW;
//	R61509V_Delay(2000);
//	R61509V_RST_HIGH;
//	
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500); //四次写0x00
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0X400,0X6200); //base image 设置 400线
//	R61509V_WriteCommand(0X010,0X0019); //面板频率
//	R61509V_WriteCommand(0X100,0X330);	//设置电源控制，平衡显示与电消耗
//	R61509V_WriteCommand(0x102,0xd1b0);R61509V_Delay(500);//PSON,PON 都设为1，电源供应打开
//	R61509V_WriteCommand(0x280,0xbf00);R61509V_Delay(500);//VCM
//	R61509V_Delay(500);
//	R61509V_WriteCommand(0X0003,0X5030);R61509V_Delay(500);//RGB设为5-6-5模式
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X0001,0X0100);//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	R61509V_WriteCommand(0X007,0X0100);//测试显示控制base image的关与开
//	R61509V_Delay(200);
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X200,0X00); //设置RAM ADDRESS
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X201,0X00); 
//	R61509V_Delay(200);


//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X401,0X01); //设置base image 滚动模式，开启滚动
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0x0C,0x0000);R61509V_Delay(1000); //外部显示接口控制，默认值
//	R61509V_WriteCommand(0x090,0x8000);R61509V_Delay(1000); //窗特征控制，FMARK interface
//	R61509V_WriteCommand(0X404,0X00);R61509V_Delay(1000);  //从0线开始滚
//	R61509V_WriteCommand(0X502,0X5f);R61509V_Delay(1000);
//	R61509V_WriteCommand(0x200,0x0000);		//RAM address 设置
//	R61509V_Delay(1000);
//	R61509V_WriteCommand(0x201,0x0000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_WriteIndex16(0X202);		//准备写入
//	R61509V_Delay(1000);
//	
//	#else
//	R61509V_WR_HIGH;
//	R61509V_RD_HIGH;
//	R61509V_CS_LOW;
//	R61509V_RST_HIGH;
//	R61509V_Delay(200);
//	R61509V_RST_LOW;
//	R61509V_Delay(2000);
//	R61509V_RST_HIGH;
//	
//	
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500); //四次写0x00
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0X400,0X6200); //base image 设置 400线
//	R61509V_WriteCommand(0X010,0X0019); //面板频率
//	R61509V_WriteCommand(0X100,0X330);	//设置电源控制，平衡显示与电消耗
//	R61509V_WriteCommand(0x102,0xd1b0);R61509V_Delay(500);//PSON,PON 都设为1，电源供应打开
//	R61509V_WriteCommand(0x280,0xbf00);R61509V_Delay(500);//VCM
//	R61509V_Delay(500);
//	R61509V_WriteCommand(0X0003,0X5030);R61509V_Delay(500);//RGB设为5-6-5模式
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X0001,0X0100);//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	R61509V_WriteCommand(0X007,0X0100);//测试显示控制base image的关与开
//	R61509V_Delay(200);
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X200,0X00); //设置RAM ADDRESS
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X201,0X00); 
//	R61509V_Delay(200);


//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X401,0X01); //设置base image 滚动模式，开启滚动
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0x0C,0x0000);R61509V_Delay(1000); //外部显示接口控制，默认值
//	R61509V_WriteCommand(0x090,0x8000);R61509V_Delay(1000); //窗特征控制，FMARK interface
//	R61509V_WriteCommand(0X404,0X00);R61509V_Delay(1000);  //从0线开始滚
//	R61509V_WriteCommand(0X502,0X5f);R61509V_Delay(1000);
//	R61509V_WriteCommand(0x200,0x0000);		//RAM address 设置
//	R61509V_Delay(1000);
//	R61509V_WriteCommand(0x201,0x0000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_WriteIndex16(0X202);		//准备写入
//	R61509V_Delay(1000);
//	#endif
}
/*******************************************************************************
*函数名			:	R61509V_Clean
*功能描述		:	清屏程序：清除屏幕函数---用背景色填充屏幕
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_Clean(u16 COLOR)	//清除屏幕函数
{
	unsigned char i;
	unsigned int j;

	R61509V_SetWindowAddress(0x00,0x00,R61509V_W-1,R61509V_H-1);
	R61509V_CS_LOW; //片选打开
	R61509V_RS_HIGH; //数据
	for(j=1;j<=R61509V_W;j++)
	{
		for(i=1;i<=R61509V_H;i++)
		{
			R61509V_WR_LOW;
			R61509V_DATABUS_PORT->ODR = COLOR;
			R61509V_WR_HIGH;
		}
	}
	R61509V_CS_HIGH;
} 
/*******************************************************************************
*函数名			:	R61509V_Clean
*功能描述		:	显示汉字程序
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_CHINESE(unsigned char zimo[720],unsigned int backcolor)  //写入字符
{
	unsigned char j,flag=0;
	unsigned char *point;
	unsigned int i,x1=0x00,x2=0x17,y1=0x00,y2=0x17;
	unsigned int colors[10]=
	{
		0xf800,0x07e0,0x001f,0xffe0,0x0000,0x07ff,0xf81f,0xb81f,0x7f7,0xfec0
	};
	point=&zimo[0];
	for(i=1;i<=720;i++,point++)
	{  
		for(j=0;j<=7;j++)
		{
			if((*point<<j)&0x80)
			{
				R61509V_WriteData16(colors[flag]);
				R61509V_Delay(1);
			}
			else
			{
				R61509V_WriteData16(backcolor);
				R61509V_Delay(1);
			}
		}   
		if(i%72==0)
		{
			x1=x1+24;x2=x2+24;y1=y1+24;y2=y2+24;
			flag=flag+1;
			R61509V_SetWindowAddress(x1,y1,x2,y2);
		}   
	}
}
/*******************************************************************************
*函数名			:	R61509V_DrawPoint
*功能描述		:	画点
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_DrawDot(u16 x,u16 y,u16 color)
{
//	R61509V_W 400
//	R61509V_H 240
	u16 x1=0,y1=0;
	switch(Sreen_Rotate)
	{
		case SCREEN_ROTATE_0D:{}
			break;
		case SCREEN_ROTATE_90D:{x1=R61509V_H-y;y=x;x=x1;}
			break;
		case SCREEN_ROTATE_180D:{x1=R61509V_H-x;y=R61509V_W-y;x=x1;}
			break;
		case	SCREEN_ROTATE_270D:{x1=y;y=R61509V_W-x;x=x1;}
			break;
		default: break;			
	}

	R61509V_SetWindowAddress(x,y,x,y);	//设置光标位置 
	R61509V_WriteData16(color); 	//笔画颜色	    
}
/*******************************************************************************
*函数名			:	R61509V_DrawPoint_big
*功能描述		:	画一个大点
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_DrawDot_big(u16 x,u16 y,u16 color)
{
//	if((x<=5)&&(y<=5))
//	{
//		R61509V_Fill(0,0,x+10,y+10,color);
//	}
//	else if((x>5)&&(y<=5))
//	{
//		R61509V_Fill(x-5,0,x+5,y+10,color);
//	}
//	else if((x<=5)&&(y>5))
//	{
//		R61509V_Fill(0,y-5,x+10,y+5,color);
//	}
//	else if((x>5)&&(y>5))
//	{
//		R61509V_Fill(x-5,y-5,x+5,y+5,color);
//	}
	
	if((x==0)&&(y==0))
	{
		R61509V_Fill(0,0,x+2,y+2,color);
	}
	else if((x>0)&&(y>0))
	{
		R61509V_Fill(x-1,y-1,x+1,y+1,color);
	}
	
//	R61509V_Fill(x-1,y-1,x+1,y+1,color);
}
/*******************************************************************************
*函数名			:	R61509V_DrawPoint_big
*功能描述		:	在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_Fill(
							u16 xsta,u16 ysta,
							u16 xend,u16 yend,
							u16 color
)
{          
	unsigned int i;
	unsigned int j;	
//	u16 x1=0,y1=0,x2=0,y2=0;

//	switch(Sreen_Rotate)
//	{
//		case 	SCREEN_ROTATE_0D:		
//					{
//						xend=xend-1;
//						yend=yend-1;
//					}
//			break;
//		case 	SCREEN_ROTATE_90D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;	
//						xsta=R61509V_H-y2;	xend=R61509V_H-y1-1;
//						ysta=x1;	yend=x2-1;
//					}
//			break;
//		case 	SCREEN_ROTATE_180D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;
//						xsta=R61509V_H-x2;	xend=R61509V_H-x1-1;
//						ysta=R61509V_W-y2;	yend=R61509V_W-y1-1;
//					}
//			break;
//		case	SCREEN_ROTATE_270D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;
//						xsta=y1;	xend=y2-1;
//						ysta=R61509V_W-x2;	yend=R61509V_W-x1-1;
//					}
//			break;
//		default: break;			
//	}
	
//	switch(Sreen_Rotate)
//	{
//		case SCREEN_ROTATE_0D:{}
//			break;
//		case SCREEN_ROTATE_90D:{x1=R61509V_H-y;y=x;x=x1;}
//			break;
//		case SCREEN_ROTATE_180D:{x1=R61509V_H-x;y=R61509V_W-y;x=x1;}
//			break;
//		case	SCREEN_ROTATE_270D:{x1=y;y=R61509V_W-x;x=x1;}
//			break;
//		default: break;			
//	}

	R61509V_SetWindowAddress(xsta,ysta,xend,yend);
	R61509V_CS_LOW; 					//片选打开
	R61509V_RS_HIGH; 					//数据
	for(i=0;i<xend-xsta;i++)
	{
		for(j=0;j<yend-ysta;j++)
		{
			R61509V_WR_LOW;
			R61509V_DATABUS_PORT->ODR = color;
			R61509V_WR_HIGH;
		}
	}
	R61509V_CS_HIGH;	
}
/*******************************************************************************
*函数名			:	R61509V_DrawPoint_big
*功能描述		:	在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
*输入				: 
*返回值			:	无
*******************************************************************************/
/*******************************************************************************
*函数名		:	LCD_DrawLine
*功能描述	:	画线
*输入			: x1,y1:起点坐标
						x2,y2:终点坐标
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void R61509V_DrawLine(
									u16 x1, u16 y1, 	//x1,y1:起点坐标
									u16 x2, u16 y2,		//x2,y2:终点坐标
									u16 color					//颜色
)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 

